Tekla Open API Reference for Tekla Structures 2025
Hideable.ShowInDrawingView Method
 Shows this object in the drawing view. Calling Modify on the object is required to show the object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void ShowInDrawingView()
Public Sub ShowInDrawingView
See Also
Reference
Hideable Class
Tekla.Structures.Drawing Namespace